Revit 2024 API
SweptBlend.BottomProfile Property
The curves which make up the bottom profile of the sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public CurveArrArray BottomProfile { get; }
Visual Basic
Public ReadOnly Property BottomProfile As CurveArrArray
	Get
Visual C++
public:
property CurveArrArray^ BottomProfile {
	CurveArrArray^ get ();
}
Remarks
The indices of the curves in this array match the indices used in the vertex connection map.
See Also
SweptBlend Class
Autodesk.Revit.DB Namespace